Revit 2027 API
PipingSystem.IsPressureDropServerMissing Method
 Indicates if any pressure drop server which was used in the piping system is not available.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPressureDropServerMissing()
Public Function IsPressureDropServerMissing As Boolean
public:
bool IsPressureDropServerMissing()
member IsPressureDropServerMissing : unit -> bool
Return Value
Boolean
 True if there is any pressure drop server not available, false otherwise.
See Also
Reference
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace